captain168/stm32f4_honglong/mp3/wm8978_wav/madlld-1.1p1/madlld.c
		/* The characteristics of the stream's first frame is printed
		 * on stderr. The first frame is representative of the entire
		 * stream.
		 */
		if(FrameCount==0)
			if(PrintFrameInfo(stderr,&Frame.header))
			{
				Status=1;
				break;
			}

		/* Accounting. The computed frame duration is in the frame
		 * header structure. It is expressed as a fixed point number
		 * whole data type is mad_timer_t. It is different from the
		 * samples fixed point format and unlike it, it can't directly
		 * be added or subtracted. The timer module provides several
		 * functions to operate on such numbers. Be careful there, as
		 * some functions of libmad's timer module receive some of
		 * their mad_timer_t arguments by value!
		 */
		FrameCount++;
		mad_timer_add(&Timer,Frame.header.duration);

		/* Between the frame decoding and samples synthesis we can
		 * perform some operations on the audio data. We do this only
		 * if some processing was required. Detailed explanations are
		 * given in the ApplyFilter() function.
		 */
//		if(DoFilter)
//			ApplyFilter(&Frame);

		/* Once decoded the frame is synthesized to PCM samples. No errors
		 * are reported by mad_synth_frame();
		 */
		mad_synth_frame(&Synth,&Frame);

		/* Synthesized samples must be converted from libmad's fixed
		 * point number to the consumer format. Here we use unsigned
		 * 16 bit big endian integers on two channels. Integer samples
		 * are temporarily stored in a buffer that is flushed when
		 * full.
		 */
		
		for(i=0;i<Synth.pcm.length;i++)
		{
			signed short	Sample;

			/* Left channel */
			Sample=MadFixedToSshort(Synth.pcm.samples[0][i]);
			#if 0
			*(OutputPtr++)=Sample>>8;
			*(OutputPtr++)=Sample&0xff;
			#elif 1
			*(OutputPtr++)=Sample;
			#endif

			/* Right channel. If the decoded stream is monophonic then
			 * the right output channel is the same as the left one.
			 */
			if(MAD_NCHANNELS(&Frame.header)==2)
				Sample=MadFixedToSshort(Synth.pcm.samples[1][i]);
			#if 0
			*(OutputPtr++)=Sample>>8;
			*(OutputPtr++)=Sample&0xff;
			#elif 1
			*(OutputPtr++)=Sample;
			#endif

			/* Flush the output buffer if it is full. */
			if(OutputPtr==OutputBufferEnd)
			{
//				if(fwrite(OutputBuffer,1,OUTPUT_BUFFER_SIZE,OutputFp)!=OUTPUT_BUFFER_SIZE)
//				{
//					printf("%s: PCM write error (%s).\r\n",
//							ProgName,strerror(errno));
//					Status=2;
//					break;
//				}
				while(wav_count<OUTPUT_BUFFER_SIZE-1);
				SPI_I2S_ITConfig(I2Sx,SPI_I2S_IT_TXE,DISABLE);
				wav_count=0;
				addr = OutputBuffer[sletbuf];
				SPI_I2S_ITConfig(I2Sx,SPI_I2S_IT_TXE,ENABLE);
				sletbuf++;
				if(sletbuf==2){
					sletbuf = 0;	
				}
	
				OutputPtr=OutputBuffer[sletbuf];
				OutputBufferEnd=OutputBuffer[sletbuf]+OUTPUT_BUFFER_SIZE;
			}
		}
	}while(1);

	/* The input file was completely read; the memory allocated by our
	 * reading module must be reclaimed.
	 */
	BstdFileDestroy(BstdFile);

	/* Mad is no longer used, the structures that were initialized must
     * now be cleared.
	 */
	mad_synth_finish(&Synth);
	mad_frame_finish(&Frame);
	mad_stream_finish(&Stream);

	/* If the output buffer is not empty and no error occurred during
     * the last write, then flush it.
	 */
	if(OutputPtr!=OutputBuffer[sletbuf] && Status!=2)
	{
		size_t	BufferSize=OutputPtr-OutputBuffer[sletbuf];

		if(fwrite(OutputBuffer[sletbuf],1,BufferSize,OutputFp)!=BufferSize)
		{
			printf("%s: PCM write error (%s).\r\n",
					ProgName,strerror(errno));
			Status=2;
		}
	}

	/* Accounting report if no error occurred. */
	if(!Status)
	{
		char	Buffer[80];

		/* The duration timer is converted to a human readable string
		 * with the versatile, but still constrained mad_timer_string()
		 * function, in a fashion not unlike strftime(). The main
		 * difference is that the timer is broken into several
		 * values according some of it's arguments. The units and
		 * fracunits arguments specify the intended conversion to be
		 * executed.
		 *
		 * The conversion unit (MAD_UNIT_MINUTES in our example) also
		 * specify the order and kind of conversion specifications
		 * that can be used in the format string.
		 *
		 * It is best to examine libmad's timer.c source-code for details
		 * of the available units, fraction of units, their meanings,
		 * the format arguments, etc.
		 */
		mad_timer_string(Timer,Buffer,"%lu:%02lu.%03u",
						 MAD_UNITS_MINUTES,MAD_UNITS_MILLISECONDS,0);
		printf("%s: %lu frames decoded (%s).\r\n",
				ProgName,FrameCount,Buffer);
	}

	/* That's the end of the world (in the H. G. Wells way). */
	return(Status);
}

#if 1
/****************************************************************************
 * Prints a message on stderr explaining the usage of the program. Two		*
 * versions of this function are provided, depending on the system type.	*
 ****************************************************************************/
static void PrintUsage(void)
{
#ifdef HAVE_GETOPT /* This version is for Unix systems. */
	printf("usage: %s [-p] [-a <amp/atten>]\r\n"
			"\t-a\tSets an amplification or attenuation factor expressed\r\n"
			"\t\tin dB. The factor bounds are [-Inf,%f].\r\n"
			"\t-p\tRequests that the output samples be filtered as if\r\n"
			"\t\ttransmitted through a telephone switch.\r\n",
			ProgName,
			20.*log10(mad_f_todouble(MAD_F_MAX)));
#else /* HAVE_GETOPT */ /* This other version is for non-Unix systems. */
	printf("usage: %s [<number>] [phone]\r\n"
			"\t<number> is a floating point number expressing an "
			"amplification\r\n"
			"\t\tor attenuation factor expressed in dB. The factor bounds\r\n"
			"\t\tare [-Inf,%f].\r\n"
			"\tThe \"phone\" argument requests that the output samples be "
			"filtered\r\n"
			"\t\tas if transmitted through a telephone switch.\r\n",
			ProgName,
			20.*log10(mad_f_todouble(MAD_F_MAX)));
#endif /* HAVE_GETOPT */
}
#endif
#if 0
/****************************************************************************
 * Command-line arguments parsing. We use two methods and two command-line	*
 * formats depending on the system type. On unix system we apply the good	*
 * old getopt() method, other system are offered a really primitive options	*
 * interface.																*
 ****************************************************************************/
static int ParseArgs(int argc, char * const argv[])
{
	int				DoPhoneFilter=0,
					i;
	double			AmpFactor;
	mad_fixed_t		Amp=MAD_F_ONE;

#ifdef HAVE_GETOPT /* This version is for Unix systems. */
	int				Option;

	/* Parse the command line. */
	while((Option=getopt(argc,argv,"a:p"))!=-1)
		switch(Option)
		{
			/* {5} Set the amplification/attenuation factor, expressed
			 * in dB.
			 */
			case 'a':
				/* If the current linear amplification factor is not
				 * one (MAD_F_ONE) then is was already set. Setting it
				 * again is not permitted.
				 */
				if(Amp!=MAD_F_ONE)
				{
					printf("%s: the amplification/attenuation factor "
							"was set several times.\r\n",ProgName);
					return(1);
				}

				/* The decibel value is converted to a linear factor.
				 * That factor is checked against the maximum value
				 * that can be stored in a mad_fixed_t. The upper
				 * bound is MAD_F_MAX, it is converted to a double
				 * value with mad_f_todouble() for comparison.
				 */
				AmpFactor=pow(10.,atof(optarg)/20);
				if(AmpFactor>mad_f_todouble(MAD_F_MAX))
				{
					printf("%s: amplification out of range.\r\n",
							ProgName);
					return(1);
				}

				/* Eventually the amplification factor is converted
				 * from double to fixed point with mad_f_tofixed().
				 */
				Amp=mad_f_tofixed(AmpFactor);
				break;

			/* {6} The output is filtered through a telephone wire. */
			case 'p':
				/* Only one occurrence of the option is permitted. */
				if(DoPhoneFilter)
				{
					printf("%s: the phone-line simulation option "
							"was already set.\r\n",ProgName);
					return(1);
				}

