captain168/stm32f4_honglong/mp3/wm8978_wav/madlld-1.1p1/madlld.c
				/* The output will be filtered through a band-pass
				 * filter simulating a phone line transmission.
				 */
				DoPhoneFilter=1;
				break;

			/* Print usage guide for invalid options. */
			case '?':
			default:
				PrintUsage();
				return(1);
		}
#else /* HAVE_GETOPT */ /* This other version is for non-Unix systems. */
	/* Scan all command-line arguments. */
	for(i=1;i<argc;i++)
	{
		/* Set the amplification factor if the current argument looks
		 * like a number. Look at the comment of the case marked {5}
		 * in the Unix section for details.
		 */
		if(*argv[i]=='+' || *argv[i]=='-' || isdigit(*argv[i]))
		{
			if(Amp!=MAD_F_ONE)
			{
				printf("%s: the amplification/attenuation factor "
						"was set several times.\r\n",ProgName);
				return(1);
			}

			AmpFactor=pow(10.,atof(argv[i])/20);
			if(AmpFactor>mad_f_todouble(MAD_F_MAX))
			{
				printf("%s: amplification out of range.\r\n",
						ProgName);
				return(1);
			}

			Amp=mad_f_tofixed(AmpFactor);
		}
		else
			/* Use the phone-like filter if the argument is the *
			 * 'phone' string. Look at the comment of the case marked
			 * {6} in the Unix section for details.
			 */
			if(strcmp(argv[i],"phone")==0)
			{
				if(DoPhoneFilter)
				{
					printf("%s: the phone-line simulation option "
							"was already set.\r\n",ProgName);
					return(1);
				}
				DoPhoneFilter=1;
			}
			else
			{
				/* The argument is not a recognized one. Print the
				 * usage guidelines and stop there.
				 */
				PrintUsage();
				return(1);
			}
	}
#endif /* HAVE_GETOPT */

	/* Initialize the subband-domain filter coefficients to one if
	 * filtering is requested.
	 */
	if(Amp!=MAD_F_ONE || DoPhoneFilter)
		for(i=0;i<32;i++)
			Filter[i]=MAD_F_ONE;

	/* The amplification/attenuation is applied to the subband-domain
     * filter definition.
	 */
	if(Amp!=MAD_F_ONE)
	{
		DoFilter=1;
		for(i=0;i<32;i++)
			Filter[i]=Amp;
	}

	/* The telephone-like filter is applied to the subband-domain
	 * filter definition. All subbands are set to zero except bands 2
	 * to 6. This programs author has no access to the MPEG audio
	 * specification, he does not know the frequencies bands covered
	 * by the MPEG subbands.
	 */
	if(DoPhoneFilter)
	{
		DoFilter=1;
		Filter[0]=MAD_F(0);
		for(i=5;i<32;i++)
			Filter[i]=MAD_F(0);
	}

	/* Command-line arguments are okay. */
	return(0);
}
#endif	

/****************************************************************************
 * Program entry point.														*
 ****************************************************************************/
FIL fp;
extern FATFS fs;
int MP3_Test(int argc, char *argv[])
{
	char	*cptr;
	int		Status;
	unsigned int res;
	unsigned char *path="1.mp3";

	/*挂载文件系统*/
	f_mount(0, &fs);
	ProgName = path;
	res = f_open(&fp,path,FA_READ);
	if(res)
	{
		while(1)
		printf("erroe");
	}
	wm8978_WriteReg(3,0xff|(1<<8)|(1)|(1<<2));
	wm8978_WriteReg(1,(1<<2)|(1<<8)|(1<<7)|(1<<3)|(1));
	wm8978_WriteReg(2,(1<<7)|(1<<8)|(1<<4)|(1<<5)|(1<<2)|(1<<3));
	wm8978_WriteReg(4,/*(1<<7)|(1<<8)|*/(2<<3)|(1<<2));
	wm8978_WriteReg(6,0);
	wm8978_WriteReg(10,1<<3);
	wm8978_WriteReg(43,1<<4);
	/* Decode stdin to stdout. */
	Status=MpegAudioDecoder(&fp,stdout);
	if(Status)
		printf("%s: an error occurred during decoding.\r\n",ProgName);

	/* All done. */
	return(Status);
}

/*  LocalWords:  BUFLEN HTAB madlld libmad bstdfile getopt subband ParseArgs JS
 */
/*  LocalWords:  DoFilter subbands errorstr bitrate scalefactor libmad's lu kb
 */
/*  LocalWords:  SWWWFFFFFFFFFFFFFFFFFFFFFFFFFFFF FRACBITS madplay fread synth
 */
/*  LocalWords:  ApplyFilter strftime fracunits atten tSets tRequest tThe tas
 */
/*  LocalWords:  ttransmitted unix todouble tofixed
 */
/*
 * Local Variables:
 * tab-width: 4
 * End:
 */

/****************************************************************************
 * End of file madlld.c														*
 ****************************************************************************/
